{
    "links": [
        {
            "href": "https://www.linkedin.com/in/munes-bani-fawaz-799151204",
            "icon": "bi bi-linkedin"
        },
        {
            "href": "https://github.com/MrGiveItAway-TPK",
            "icon": "bi bi-github"
        },
        {
            "href": "https://www.youtube.com/@munesbanifawaz",
            "icon": "bi bi-youtube"
        },
        {
            "href": "https://wa.me/962789336602",
            "icon": "bi bi-whatsapp"
        },
        {
            "href": "https://www.facebook.com/munes.mutasem.1",
            "icon": "bi bi-facebook"
        },
        {
            "href": "https://www.instagram.com/munes.bani.fawaz",
            "icon": "bi bi-instagram"
        },
        {
            "href": "https://www.twitch.tv/mrgiveitaway_tpk",
            "icon": "bi bi-twitch"
        }
    ],
    "skills": 
    {
        "columns":2,
        "data":[
            { "name": "C#", "level": 75 },
            { "name": "Java", "level": 60 },
            { "name": "Python", "level": 100 },
            { "name": "C++", "level": 75 },
            { "name": "PHP", "level": 100 },
            { "name": "HTML", "level": 100 },
            { "name": "CSS", "level": 100 },
            { "name": "JavaScript", "level": 100 },
            { "name": "SQL/MySQL", "level": 100 },
            { "name": "VB", "level": 60 },
            { "name": "Visual Basic", "level": 60 },
            { "name": "VBS", "level": 60 },
            { "name": "BAT", "level": 100 },
            { "name": "Visual Studio", "level": 75 },
            { "name": ".NET", "level": 60 },
            { "name": "ASP.net", "level": 60 },
            { "name": "React", "level": 75 },
            { "name": "Angular", "level": 75 },
            { "name": "Laravel", "level": 75 },
            { "name": "Flutter", "level": 90 },
            { "name": "Node.js", "level": 100 },
            { "name": "Frappe", "level": 100 },
            { "name": "Jinja", "level": 100 },
            { "name": "ERPNext", "level": 100 },
            { "name": "Unreal Engine", "level": 75 },
            { "name": "Unity", "level": 90 },
            { "name": "Linux (Kali, Ubuntu, Manjaro)", "level": 100 },
            { "name": "Docker", "level": 90 }
          ]
    },
    "resume":
    {
        "summary": {
          "name": "MUNES BANI FAWAZ",
          "description": "Senior Full Stack Developer A.K.A Mr. Automator AIO - Developer - Front, Back, Mobile, Shell- Just Name It!",
          "contact": [
            "Phone: +962789336602",
            "Email: m.banifawaz@outlook.com",
            "Date of Birth: 04/09/1998",
            "Nationality: Jordanian"
          ]
        },
        "education": [
          {
            "degree": "Bachelor’s Degree in Software Engineering",
            "year": "10/2017 – 02/2021",
            "institution": "Philadelphia University of Jordan (Amman, Jordan)",
            "description": "Graduated with an average of 77.6% (Very Good), equivalent to a GPA of 3.1/4."
          },
          {
            "degree": "High School Diploma",
            "year": "2013 – 2016",
            "institution": "First Secondary School of Abha (Abha, Saudi Arabia)",
            "description": "Achieved an average of 96.03%, equivalent to 80.08% (Jordan Ministry of Education Certification)."
          },
          {
            "degree": "Additional Education",
            "year": "2001 – 2013",
            "institution": "Various Institutions",
            "description": "Mecca Intermediate School (Abha, Saudi Arabia) | 2010 – 2013\nAnjara Elementary School (Ajlun, Jordan) | 2009 – 2010\nRobert-Koch Realschule (Stuttgart, Germany) | 2008 – 2009\nPfaffenwald-Schule (Stuttgart, Germany) | 2004 – 2008\nKinderhaus Uni-Kids (Stuttgart, Germany) | 2001 – 2004"
          }
        ],
        "experience": [
          {
            "title": "MID ERP Full Stack Developer",
            "year": "December 2023 – Present",
            "company": "Syarah",
            "responsibilities": [
                "Conducted Frappe/ERPNext, Python, and JavaScript training, mentoring team members to enhance technical skills.",
                "Upgraded Frappe/ERPNext from v13 to v15, separating and optimizing a built-in Vue.js application.",
                "Created a customizable Kanban board and resolved complex related issues.",
                "Managed environments for UAT, QA, Preproduction, and Outsourcing pipelines.",
                "Built the Frappe Developer Toolbox, increasing development efficiency."
              ]
          },
          {
            "title": "ERP Full Stack Developer",
            "year": "September 2022 – December 2023",
            "company": "Nixpend",
            "responsibilities": [
                "Built custom Doctypes and modules with related reports and functionalities, including HR, appointment bookings, accounting, and procedural enhancements.",
                "Developed a Revenue Sharing Module to automate distribution of revenue via invoices for healthcare practitioners.",
                "Created custom APIs and integrated the ERP system with external healthcare systems like Medical.",
                "Oversaw ticket distribution and managed weekly updates/releases, including code reviews and merge requests.",
                "Enhanced system scalability and reliability through cloud integrations and optimized configurations."
              ]
          },
          {
            "title": "System Development Officer",
            "year": "June 2021 – March 2022",
            "company": "Extensya",
            "responsibilities": [
                "Created and maintained web forms for quality evaluations and call logging, serving ~40 clients.",
                "Developed internal systems such as ECT (employee announcements), online/English assessments, Extensya's chat tool, and live agent help desk.",
                "Built custom APIs, including data retrieval from Zendesk and exporting data to Excel sheets (CSV/XLS).",
                "Developed a digital library with a file manager for upload/delete operations and a tree-view structure for file browsing.",
                "Streamlined company workflows by creating tools and scripts for editing, debugging, and testing internal systems."
              ]
          }
        ]
      },
      "testimonials":[
        {
          "text": "I highly recommend Munes as a talented and dedicated programmer. His proficiency in programming languages is commendable, and he excels in problem-solving. During our time as colleagues, Munes consistently demonstrated his expertise in coding and was a valuable asset to the team. Notably, Munes played a crucial role in assisting me during our training period. His willingness to share knowledge and provide support greatly contributed to my learning experience. I have witnessed firsthand his exceptional problem-solving skills and creative approach to programming challenges. Munes's commitment to excellence and collaborative spirit make him an outstanding team member. I am confident that his skills and positive attitude will continue to make significant contributions wherever he goes.",
          "image": "assets/img/testimonials/aokasha.jpg",
          "name": "Ahmad Okasha",
          "title": "Software Engineer at Nixpend"
        },
        {
          "text": "I am delighted to recommend Munis Fawaz as a software engineer. I had the pleasure of training Munis at Nixpend Sequential Technologies. His ability to grasp knowledge quickly and his innovative problem-solving skills make him a standout candidate. He is not the type of guy to complain when he faces a problem, rather he focuses on how to approach the problem and break it down. He is initiative, when discovers something to automate or a code to optimize he immediately raises the flag and takes the lead to handle it. He's got a beautiful sense of humor which is amazing to have especially in a stressful environment.",
          "image": "assets/img/testimonials/mabdullah.jpg",
          "name": "Mohammad Abdulla",
          "title": "Software Engineer | AWS SAA"
        },
        {
          "text": "I recommend Munes as a Full Stack Engineer. He possesses strong technical skills, consistently solving complex problems efficiently. One of the unique things about Munes is that he proposes improvements to the system, and is not just someone who carries out instructions.",
          "image": "assets/img/testimonials/sfateh.jpg",
          "name": "Salah Aldin Fateh",
          "title": "DevOps Engineer at Nixpend"
        },
        {
          "text": "I am writing to highly recommend my esteemed colleague, Munes Bani Fawaz, for any professional opportunity that he may pursue in the future. As a Senior Software Engineer, Munes has consistently demonstrated an extraordinary level of skill, dedication, and innovation in his work, earning him the affectionate moniker of \"Mr. Automator\" amongst our team. Munes's remarkable abilities in the field of software engineering have had a profound impact on our team and the projects we have undertaken. One of Munes's most outstanding qualities is his incredible proficiency in automating complex and time-consuming tasks. He has a unique talent for simplifying and optimizing workflows, making our daily work more efficient and less error-prone. The improvements he has made through automation have not only saved us countless hours but have also significantly reduced the margin for human error, improving the overall quality of our work. Munes is not just an automation wizard; he is also an exceptional problem solver. He possesses a keen analytical mind, which enables him to dissect complex issues and devise elegant solutions. His ability to approach challenges with creativity and logical thinking is a testament to his problem-solving prowess. Whenever our team has faced roadblocks, Munes has been the go-to person to find innovative solutions and guide us back on track. Munes's dedication to his work is unwavering. He consistently goes above and beyond to meet project deadlines and deliver high-quality results. His ability to adapt to new technologies and stay up-to-date with industry trends showcases his commitment to continuous learning and growth. His collaborative and communicative nature makes him an invaluable asset to our team, as he readily shares his knowledge and supports his colleagues.",
          "image": "assets/img/testimonials/mshammout.jpg",
          "name": "Moneeb Shammout",
          "title": "Backend Engineer | Software Engineer"
        },
        {
          "text": "Professional, team player & passionate about what he does! It was a privilege to work with Munes.",
          "image": "assets/img/testimonials/akurdi.jpg",
          "name": "Dr. Abdul Kareem Kurdi",
          "title": "Manager of Pharmacies Department /Hakeem Claim (EHSI)"
        },
        {
          "text": "I highly recommend Munes as a Full Stack Developer. His expertise in both front-end and back-end technologies is impressive. Munes consistently delivers high-quality, efficient solutions and is a valuable asset to any development team.",
          "image": "assets/img/testimonials/wzoubi.jpg",
          "name": "Wesam AL-Zoubi",
          "title": "Accounting at AL-Balqa'a Applied University"
        },
        {
          "text": "I have had the pleasure of working alongside Munes, and I can confidently attest to his exceptional skills as a developer. Collaborating with him is not only enjoyable but also incredibly enriching. Munes combines his technical prowess with a great sense of humor, making our work environment not just productive but also fun. His ability to lighten the atmosphere while delivering top-notch development solutions is truly remarkable. I wholeheartedly recommend Munes for his technical expertise, collaborative spirit, and the delightful touch of humor he brings to any team.",
          "image": "assets/img/testimonials/sayman.jpg",
          "name": "Sa'ed Ayman",
          "title": "Software Developer @ Nixpend - Sequential Technologies"
        },
        {
          "text": "I highly recommended Munes as a full_stack developer, he is very strong problem solver using simplest ways, and he is quick learner, eager to learn new things and mastered it in short time, he has a creativity thought to make special touches on his work and he is very supportive and helper person. Wish you all the best Munes.",
          "image": "assets/img/testimonials/amomani.jpg",
          "name": "As'har Momani",
          "title": "Computer Engineering | Application Engineer"
        },
        {
          "text": "I highly recommend Munes as a full-stack developer. His work ethic is unmatched, and he excels in resolving coding challenges. A go-to person for bug fixes, he willingly shares his extensive knowledge, making collaboration a breeze. His commitment and passion for continuous learning make him an invaluable asset to any team.",
          "image": "assets/img/testimonials/msader.jpg",
          "name": "Mahmoud H. Sadder",
          "title": "Support | QA Engineer"
        },
        {
          "text": "I am writing to recommend Munes based on his exceptional performance during his tenure at Extensya under my guidance. Munes exhibited an impressive ability to rapidly grasp complex concepts and swiftly apply them to tasks. His remarkable aptitude for learning was evident as he consistently displayed a deep understanding of the projects he was involved in. Moreover, his organizational skills were remarkable, allowing him to handle multiple tasks efficiently and effectively. Munes's exceptional efficiency and dedication to meeting deadlines while maintaining a high standard of work made him a key contributor to our team's success. His resourcefulness, creative approach to problem-solving, and willingness to take initiative greatly contributed to the innovative solutions we were able to implement. Overall, Munes demonstrated intelligence, resourcefulness, and an exceptional work ethic, and his positive attitude and eagerness to learn served as an inspiration to his peers. I wholeheartedly recommend Munes for any role where his technical skills, adaptability, and dedication would be valued.",
          "image": "assets/img/testimonials/empty.png",
          "name": "Fadia Elmabrouk",
          "title": "Software Engineer | Extensya"
        },
        {
          "text": "It is my pleasure to strongly recommend Munes Bani Fawaz for a position as a Systems Development Officer. I am Murad Fares, a Systems Development Manager at Extensya, and with my 15 years of experience in software development, I have encountered many young professionals, but Munes stands out. During our time working together, Munes displayed great talents in technical applications and programming languages, including PHP, SQL DB, CSS, CMS, JavaScript, and various data visualization tools. I am confident that Munes would be a valuable asset to your company. He not only possesses the skills and experience you're seeking, but he will also contribute significantly and help your company grow.",
          "image": "assets/img/testimonials/murad.jpg",
          "name": "Murad Fares",
          "title": "Systems Development Manager | Extensya"
        }     
      ],   
      "portfolio": {
        "filters": [
          { "value": "*", "label": "All", "active": true },
          { "value": ".filter-app", "label": "Apps", "active": false },
          { "value": ".filter-web", "label": "Web", "active": false },
          { "value": ".filter-project", "label": "Projects", "active": false },
          { "value": ".filter-script", "label": "Scripts", "active": false },
          { "value": ".filter-courses", "label": "Courses", "active": false }
        ],
        "items": [
          {
            "category": "filter-app",
            "image": "assets/img/portfolio/jordan_prayer_times.png",
            "title": "Jordan Prayer Times",
            "shortDescription":"Get accurate prayer times in Jordan with notifications.",
            "description": "Jordan Prayer Times is a comprehensive and easy-to-use app that helps you stay on track with your daily prayers. Whether you're at home, at work, or on the go, this app provides accurate prayer times based on your location in Jordan and allows you to have notifications to suit your preferences.",
            "galleryGroup": "portfolio-gallery-app",
            "stack":"Flutter | Node JS",
            "platform":"Android | iOS",
            "client":"Munes Bani Fawaz",
            "projectDate":"Jan 8, 2025",
            "projectURL":"https://play.google.com/store/apps/details?id=com.mbf.jordan_prayer_times_app",
            "projectURLText":"Google Play Store"
          },
          {
            "category": "filter-app",
            "image": "assets/img/portfolio/cmr.png",
            "title": "Cubic Maze Runner",
            "shortDescription":"Game Inspired By Subway And Piano Tiles",
            "description": "Cubic Maze Runner is an exciting game inspired by the fast-paced action of Subway Surfers and the rhythm-based gameplay of Piano Tiles. In this game, players navigate through challenging levels while tapping to the beat of the music, avoiding obstacles, and scoring high points. With a smooth, addictive gameplay experience, this game will keep you engaged for hours as you aim to beat your best score.",
            "galleryGroup": "portfolio-gallery-app",
            "stack":"Unity | C#",
            "platform":"Android | iOS | Windows",
            "client":"Munes Bani Fawaz",
            "projectDate":"TBA",
            "projectURL":"#",
            "projectURLText":"TBA"
          },
          {
            "category": "filter-web",
            "image": "assets/img/portfolio/iloveyou.png",
            "title": "I Love You ♥♥♥",
            "shortDescription": "A heartfelt interactive webpage featuring song lyrics with a typewriter effect.",
            "description": "This project is a visually appealing and interactive webpage that displays song lyrics in a typewriter effect, inspired by the song 'All of Me' by John Legend. The page includes a heart-like button that, when clicked, starts the animation of the song lyrics and plays the music. The background and button transition between grayscale and normal modes to create a visually dynamic experience. The project is designed to evoke emotions through its heartwarming theme and smooth animations.",
            "galleryGroup": "portfolio-gallery-website",
            "stack": "HTML | CSS | JavaScript",
            "platform": "Web",
            "client": "Munes Bani Fawaz",
            "projectDate": "Nov 15, 2022",
            "projectURL": "https://mrgiveitaway-tpk.github.io/I_Love_You/",
            "projectURLText": "Visit Website"
          },
          {
            "category": "filter-web",
            "image": "assets/img/portfolio/comingsoon.png",
            "title": "Coming Soon Template",
            "shortDescription": "A responsive website template for a 'Coming Soon' page",
            "description": "This 'Coming Soon' template is designed to showcase a website that is currently under construction. Featuring an engaging and smooth animation, it provides visitors with an exciting preview of what's to come. The layout is fully responsive, ensuring a seamless experience on all devices, from desktops to smartphones. Perfect for businesses or personal projects, this template sets the tone for what's next while keeping your audience engaged and informed about the upcoming launch.",
            "galleryGroup": "portfolio-gallery-website",
            "stack": "HTML | CSS | JavaScript",
            "platform": "Web",
            "client": "Munes Bani Fawaz",
            "projectDate": "Feb 4, 2024",
            "projectURL": "https://mbanifawaz.github.io/coming-soon/",
            "projectURLText": "Visit Website"
          },
          {
            "category": "filter-courses",
            "image": "assets/img/portfolio/pythonfundementals.jpg",
            "title": "Python Fundamentals",
            "shortDescription": "Learn the basics of Python: setup, data types, control flow, functions, and OOP.",
            "description": "This presentation will cover the basics of Python programming, from setting up your environment to exploring essential concepts and techniques. We will delve into data types, control flow, functions, modules and object-oriented programming, equipping you with the foundational knowledge necessary for effective Python development. Let's embark on this journey together!",
            "galleryGroup": "portfolio-gallery-website",
            "stack": "Python",
            "platform": "The Human Mind",
            "client": "Munes Bani Fawaz",
            "projectDate": "Jan 11, 2025",
            "projectURL": "https://github.com/mbanifawaz/Python-Fundamentals-Presentation",
            "projectURLText": "Get Material"
          },
          {
            "category": "filter-web filter-app filter-project",
            "image": "assets/img/portfolio/pos.gif",
            "title": "Point of Sale Client Demo",
            "shortDescription": "A seamless checkout-free shopping experience.",
            "description": "Experience the future of shopping with a smart Point of Sale (POS) demo inspired by Amazon Go. This cutting-edge system uses barcode scanning to enable a seamless, checkout-free shopping experience. Customers can simply enter, pick up their desired items, and leave—no lines, no waiting. Payments are handled automatically through the POS device, delivering unmatched convenience and efficiency. Ideal for busy individuals who prioritize their time and prefer hassle-free shopping!",
            "galleryGroup": "portfolio-gallery-website",
            "stack": "Angular | Node JS | SQLite",
            "platform": "Web | PWA",
            "client": "Wowly",
            "projectDate": "2023",
            "projectURL": "https://www.itswowly.com/home",
            "projectURLText": "Client Page"
          }
          
        ]
      },
    "config":
    {
        "maintenance_mode":0
    }
  }